<a href="https://colab.research.google.com/github/ljs7463/study-repository/blob/master/%ED%8C%8C%EC%9D%B4%EC%8D%AC%EC%97%B0%EC%8A%B5(beginner)/Data%20analysis%20practice/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
series : 1차원으로 이루어진 데이터 배열
DataFrame : 2차원으로 이루어진 데이터 배열

In [ ]:
import pandas as pd
pd

# Pandas 의 Series 와 DataFrame

1차원, 1개의 column은 Series라고 합니다.

In [ ]:
pd.Series([1, 2, 3, 4])

In [ ]:
a = [1, 2, 3, 4]
pd.Series(a)

In [ ]:
mylist = [1, 2, 3, 4]
pd.Series(mylist)

# DataFrame

방법 1. list로 만들기

In [ ]:
company1 = [['삼성', 2000, '스마트폰'],
           ['현대', 1000, '자동차'],
           ['네이버', 500, '포털']]

In [ ]:
pd.DataFrame(company1)

In [ ]:
df1 = pd.DataFrame(company1)
df1

제목 컬럼 만들기

In [ ]:
df1.columns = ['기업명','매출액','업종']
df1.index = ['첫 번째', '두 번째', '세 번째']
df1

방법2. dict로 만들기

In [ ]:
company2 = {'기업명':['삼성','현대','네이버'],
           '매출액': [2000, 1000, 500],
           '업종': ['스마트폰', '자동차', '포털']
           }
df2 = pd.DataFrame(company2)
df2

index를 특정 column으로 지정하기

In [ ]:
df1
df1.index = df1['기업명']
df1

series = column 이라고 하였습니다. 확인해 볼까요?

In [ ]:
df1['매출액']

In [ ]:
type(df1['매출액'])

# 1. CSV 파일 읽어오기

CSV 파일 이란?
   - Comma Separated Value의 약어로써, 쉼표로 구분된 파일(tab으로도 가능)
   - 엑셀을 로딩할 수도 있지만, 쉼표로 구분된 파일이 훨씬 가볍다
   - 공공데이터포털 에서도 CSV 포맷의 파일을 제공한다.

1-1. 파일1) 로컬에서 파일 읽어오기(복습) - 초심자가 진행하기에 번거롭기 때문에 비추천

In [ ]:
from google.colab import files
myfile = files.upload()

In [ ]:
import io

In [ ]:
pd.read_csv(io.BytesIO(myfile['korean-idol.csv']))

1-2. 방법2) 구글 드라이브에 있는 샘플 파일 읽어오기

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

In [ ]:
import pandas as pd
filename = '/content/drive/MyDrive/pandas/02. Part1.[파이썬 필수 스킬] 데이터분석의 시작, 전처리 라이브러리/data/korean-idol.csv'
pd.read_csv(filename)  # pd.read_csv() 판다스 에서 csv파일 읽어 오기

1-3. 방법3) 파일 URL로 부터 바로 읽어오기

In [ ]:
pd.read_csv('http://bit.ly/ds-korean-idol')

1. 엑셀 파일 읽어오기

엑셀 파일을 읽어 올 때는 read_excel()함수를 사용합니다.

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

In [ ]:
import pandas as pd
filename = '/content/drive/MyDrive/pandas/02. Part1.[파이썬 필수 스킬] 데이터분석의 시작, 전처리 라이브러리/data/korean-idol.xlsx'

In [ ]:
pd.read_excel(filename)

1. 파일 읽어오기(csv)

In [ ]:
import pandas as pd
df =pd.read_csv('/content/drive/MyDrive/pandas/02. Part1.[파이썬 필수 스킬] 데이터분석의 시작, 전처리 라이브러리/data/korean-idol.csv')
df

2. 기본 정보 알아보기 (index, column, info)

2-1. column(열) 출력하기

In [ ]:
df.columns

2-2. column(열) 이름 재정의하기

In [ ]:
new_col = ['name', '그룹', '소속사', '성별', '생년월일', '키', '혈액형', '브랜드평판지수'] # 기존 cloumn과 같은 수
df.columns = new_col
df.columns

In [ ]:
df

2-2. index(행) 출력하기

In [ ]:
df.index

2-3. info는 기본적인 row(행)의 정보와 데이터 타입을 알려줍니다.

tip. info 메소드는 주로 빠진 값(null값)과 데이터 타입을 볼 때 활용합니다.

In [ ]:
df.info()

3. 통계 정보 알아보기(describe)

In [ ]:
df.describe() #산술 연산만 할 수 있는 column 만 출력한다.

4. 형태(shape) 알아보기
  - shape는 tuple 형태로 반환되며, 첫번째는 row, 두번째는 column의 숫자를 의미합니다.

In [ ]:
df.shape

5. 상위 5개, 하위 5개의 정보만 보기

가장 자주쓰는 메소드 중 하나인 head(), tail()입니다.
  - head() 상위 5개 row출력
  - tail() 하위 5개 row출력
  - head(3) 상위 3개 row출력
  - tail(2) 하위 2개 row출력

In [ ]:
df.head()

In [ ]:
df.tail()

In [ ]:
df.head(3)

7. 정렬하기

7-1. 오름차순 정렬(default)

In [ ]:
df.sort_index()

7-2.  내림차순 index 정렬

In [ ]:
df.sort_index(ascending=False)

8. column 별로 정렬

8-1. 오름차순 정렬

In [ ]:
df.sort_values(by = '키')

8-2. 내림차순 정렬

In [ ]:
df.sort_values(by = '키',ascending=False )

[BONUS] 복수정렬

In [ ]:
df.sort_values(by = ['키', '브랜드평판지수']) #키순서대로 하고 같은 거는 브랜드평판지수순서로

In [ ]:
df.sort_values(by = ['키', '브랜드평판지수'], ascending=False)

1. Column을 선택하는 방법

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

In [ ]:
df= pd.read_csv('/content/drive/MyDrive/pandas/02. Part1.[파이썬 필수 스킬] 데이터분석의 시작, 전처리 라이브러리/data/korean-idol.csv')
df.head()

In [ ]:
df['혈액형'] # 추천

In [ ]:
df.혈액형

2. 범위 선택(range selection)

2-1. 단순 index에 대한 범위 선택

In [ ]:
df[:3] # = df.head(3)

2-2 . loc

(앞으로 굉장히 자주 사용합니다. 반드시 손에 익숙해 지도록 합시다!)

In [ ]:
df.loc[:,'이름'] # row 전체 컬럼 은 이름만

In [ ]:
df.loc[:, ['이름', '생년월일']]

In [ ]:
df.loc[3:8, ['이름','생년월일']] 
# pandas에서 loc는 a:b 에서 b이하로 가져옴 즉 b포함해서 가져온다. numpy 는 a: b 일경우 b미만

In [ ]:
df.loc[2:5, '이름':'생년월일']

2-3. iloc(position으로 색인)

(i는 인덱스 즉 번호로 가지고 오고 싶을 때 사용)

In [ ]:
df.iloc[:,[0,2]]

In [ ]:
df.iloc[1:5,[0,2]] 
#iloc에서는 다시 a  : b 에서 b미만이 된다

In [ ]:
df.iloc[1:5,1:4]

3. Boolean Indexing - 조건을 활용한 색인

Boolean Indexing은 Numpy에서 배웠 Boolean 인덱싱과 같은 원리입니다.

In [ ]:
df['키'] > 180

위 처럼 Boolean을 이용해서 구분하는 것으로 끝나는게 아닌 원하는 즉 색출하고자 하는 데이터 를 뽑아내는것이 목적 

Boolean Index로 받은 index 를 활용해서 True인 값만 색인해 낼 수 있습니다.

  - df[] 꺾쇠로 감싸주고, 그 안에 Boolean Index를 넣어주시면 됩니다.

In [ ]:
df[df['키'] < 170]

위와 같은 방법이 매우 간편한 방법이기는 하지만, 모든 column을 출력해야만 한다는 한계가 있습니다.

  - 특정 column과 같이 색인해 내고 싶을땐 어떻게 할까요?

In [ ]:
#df[df['키'] > 180 , '이름'] 이렇게 하면 에러가 남

해결방법 1. 맨 뒤에 출력할 column 붙히기

In [ ]:
df[df['키']>180]['이름']

In [ ]:
df[df['키'] > 180][['이름', '키']]

해결방법 2. loc를 활용 (추천)

In [ ]:
df.loc[df['키']>180, '이름']

In [ ]:
df.loc[df['키']>180, '이름' : '성별']

In [ ]:
df.loc[df['키']>180, ['이름','키']] #따로 할 떄는 리스트로

4. isin을 활용한 색인

isin을 활용한 색인은 내가 조건을 걸고자 하는 값이 내가 정의한 list에 있을 때만 색인하려는 경우에 사용합니다.

In [ ]:
my_condition = ['플레디스', 'SM']

In [ ]:
df['소속사'].isin(my_condition) #소속사라는 컬럼을 지정하고(지정!!) 그 안에 isin()안에 있는 값들이 있어?

In [ ]:
df.loc[df['소속사'].isin(my_condition),'소속사']

5. 결측값(Null)알아보기

5-1. NaN 값에 대하여

  - Null 값은 비어있는 값, 고급 언어로 결측값입니다.
  - pandas 에서는 NaN => Not a Number로 표기 된 것을 확인해 볼 수 있습니다.

In [ ]:
df # 결측값 즉, NaN값은 데이터다룸에 있어서 중요한 요소로 작용을 한다.

info()로 NaN값, 즉 빠진 데이터가 어디에 있는지 쉽게 요약정보로 확인할 수 있습니다. (빠진데이터를 처리하는것도 중요하고 처리하는 방식 또한 중요하다)

In [ ]:
df.info()

5-2.결측 값 다루기

Boolean 인덱싱

In [ ]:
df.isna() #isna 빠진값이야? #하지만 이렇게 하면 보기가 여전히 불편하다

info() 메소드를 통해서 전체적으로 어떤 column에 빠진 데이터가 있는지 알아 보았습니다. 또한, 다음과 같이 특정 column에서 빠진값을 색출해 낼 수 있습니다.

1. Boolean 인덱싱으로 True가 return되는 값이 NaN이라는 것을 알 수 있습니다.

In [ ]:
df['그룹'].isnull() #isnull로도 가능

2. NaN값만 색출해내기

In [ ]:
df['그룹'][df['그룹'].isnull()]

In [ ]:
df['그룹'][df['그룹'].isna()]

3. NaN이 아닌 값에 대하여 Boolean인덱싱(비어있지 않은값도 추출해야할 경우도 있음)

In [ ]:
df['그룹'].notnull()

4. NaN이 아닌 값만 색출해 내기

In [ ]:
df['그룹'][df['그룹'].notnull()]

In [ ]:
df.loc[df['그룹'].isnull()]
# df.loc[df['그룹'].isnull(),['키', '혈액형']]

1. copy (복사)

copy는 단어 그대로, dataframe을 복사할 때 사용합니다.

In [ ]:
df.head()

df를 새로운 변수 (new_df)에 대입해 주고, 새로운 변수에서 값을 바꾼다면, 원래의 DataFrame의 값은 어떻게 될까요?

In [ ]:
new_df = df.copy()
new_df['이름'] = 0
df.head

이렇게 되는 이유는 같은 메모리 주소를 참조하기 때문이다.
즉, 여러가지 실험을 해볼 때 쓰는용도

굉장히 많은 분들이 실수를 하시는 부분입니다.

원본 데이터를 유지 시키고, 새로운 변수에 복사할 때는 copy()를 사용해 주세요

In [ ]:
copy_df = df.copy() #카피된 자료를 편집시키면서 여러가지를 해도 원본데이터는 편하지 않는다.

2 . row, column 추가 및 삭제

2-1. row의 추가

In [ ]:
df.head()

In [ ]:
df = pd.read_csv('/content/drive/MyDrive/pandas/02. Part1.[파이썬 필수 스킬] 데이터분석의 시작, 전처리 라이브러리/data/korean-idol.csv')
import pandas as pd

dictionary 형태의 데이터를 만들어 준 다음 append()함수를 사용하여 데이터를 추가할 수 있습니다. 반드시, ignore_index = True옵션을 같이 추가해 주셔야 에러가 안납니다.

In [ ]:
df = df.append({'이름' : '테디', '그룹' : '테디그룹', '소속사' :'끝내주는소속사', '성별' : '남자', '생년월일' : '1970-01-01', '키': 195.0, '혈액형' : '0', '브랜드평판지수': 12345678 },ignore_index = True)
df

In [ ]:
df.tail()

2- 2. column 추가

column 추가는 매우 쉽습니다. 단순히 새로운 column을 만들고 값을 대입해주면, 자동으로 생성됩니다.

In [ ]:
df.head()

In [ ]:
df['국적'] = '대한민국'
df.head()

전부 동일한 값이 추가 되면서, column도 추가된 것을 보실 수 있습니다.

만약, 값을 변경하고 싶다면, loc함수를 활용해서 변경해 줄 수 있겠죠?

In [ ]:
df.loc[df['이름'] == '지드래곤', '국적'] = 'korea'
df.head()

3. 통계값 다루기

In [ ]:
from google.colab import drive
drive.mount('/content/mydrive')

In [ ]:
import pandas as pd
df= pd.read_csv('https://bit.ly/ds-korean-idol')

통계값은 data type이 float나 int형 인 column을 다룹니다.

In [ ]:
df.describe() #count 해당 컬럼의 개수(row) / mean 평균 / std 표준편차 / min 최소값 / 각 퍼센트대에 대한 값(지표) / max 최대값

3-1. min(최소값), max(최대값)

통계값은 data type이 float나 int형 인 column을 다룹니다

In [ ]:
df['키'].min()

In [ ]:
df['키'].max()

3-2. sum(합계), mean(평균)

In [ ]:
df['키'].sum()

In [ ]:
df['키'].mean()

3-3. var, variance(분산)/ std, standard deviation(표준편차)

  - 분산과 표준편차는 데이터가 평균으로부터 얼마나 떨어져 있는지 정도를 나타냅니다.
  - 분산은(데이터- 평균)**2을 모두 합한 값 / n
  - 표준편차는 분산의 루트

In [ ]:
import numpy as np

In [ ]:
data_01 = np.array([1, 3, 5, 7, 9])
data_02 = np.array([3, 4, 5, 6, 7])

In [ ]:
data_01.mean()

In [ ]:
data_02.mean() #둘의 평균이 같으면 분산 도 같을까?

In [ ]:
data_01.var(), data_02.var() # 분산 값이 크다 = 데이터가 더 넓게 퍼저 있다.

In [ ]:
np.sqrt(data_01.var()), np.sqrt(data_02.var()) #분산에 루트값을 씌우면 표준편차데이터가 나온다(sqrt = 제곱근 = 루트)

In [ ]:
data_01.std(), data_02.std()

주로 분산보다 표준편차(std)를 많이 사용하며, 데이터가 평균으로 부터 얼마나 퍼져있는지 정도를 나타내는 지표라고 이해하시면 됩니다.

In [ ]:
df['키'].var()

In [ ]:
df['키'].std()

3-4. 갯수를 세는 count

In [ ]:
df['키'].count()

3-5. 중앙값

In [ ]:
df['키'].median()

3-6. 최빈값(mode)

In [ ]:
df['키'].mode()

4. 피벗테이블(pivot_table)

  - 피벗테이블은 엑셀의 피벗테이블과 동일합니다.
  - 데이터 열 중에서 두 개의 열을 각각 행 인덱스, 열 인덱스로 사용하여 데이터를 조화하여 펼쳐놓은 것을 의미합니다.
  - 왼쪽에 나타나는 인덱스를 행 인덱스, 상단에 나타나는 인덱스를 열 인덱스라고 부릅니다.

In [ ]:
df.head()

In [ ]:
pd.pivot_table(df, index = '소속사', columns = '혈액형', values = '키') # 겹치는데이터는 평균값이 나옴

In [ ]:
index는 행 인덱스
columns는 열 인덱스
values는 조회하고 싶은 값
즉 행인덱스와 열인덱스는 내가 분류하고싶은 것 이고 values는 내가 확인하고 싶은 값을 의미한다.

In [ ]:
# aggfunc에는 추가 계산 옵션 (np.sum, np.mean) - 기본값은 평균
import numpy as np
pd.pivot_table(df, index = '그룹', columns = '혈액형', values = '브랜드평판지수', aggfunc = np.sum)

5. GroupBy (그룹으로 묶어 보기)

  - groupby는 데이터를 그룹으로 묶어 분석할 때 활용합니다.
  - 소속사별 키의 평균, 성별 키의 평균 등 특정, 그룹별 통계 및 데이터 성질을 확인하고자 할 때 활용합니다.

In [ ]:
df.head()

In [ ]:
df.groupby('소속사') # 묶어둔 상태 이다.  이제 취하고자 하는 통계 함수를 넣어주면된다.

groupby와 함께
  
  - count() - 갯수
  - sum() - 합계
  - mean() - 평균
  - var() - 분산
  - std() - 표준편차
  - min()/max() - 최소값,최대값

In [ ]:
df.groupby('소속사').count()

산술 통계는 자동으로 산술통계가 가능한 열만 출력됩니다.

In [ ]:
df.groupby('그룹').mean()

In [ ]:
df.groupby('성별').sum()

특정 열만 출력하고 싶다면?

In [ ]:
df.groupby('혈액형')['키'].mean()

6. Multi-Index(복합 인덱스)

6-1. Multi-Index 적용

행 인덱스를 복합적으로 구성하고 싶은 경우 인덱스를 리스트로 만들어 줍니다.

In [ ]:
df.groupby(['혈액형','성별']).mean() # 혈액형 별로 분류하고 다시한번 성별로 분류해준다.

6-2. Multi-Index 데이터 프레임을 피벗 테이블로 변환

 Multi-Index로 된 데이터 프레임을 피벗 테이블 형태로 다시 변환해 줄 수 있습니다.

In [ ]:
df2 = df.groupby(['혈액형','성별']).mean()

In [ ]:
df2.unstack('혈액형')

In [ ]:
df2.unstack('성별')

6-3. 인덱스 초기화(reset_index)

reset_index()는 Multi-index로 구성된 데이터 프레임의 인덱스를 초기화해 줍니다.

In [ ]:
df2

In [ ]:
df2.reset_index() # 컬럼을 인덱스로 바껴져있는걸 일반 데이터 프레임으로 초기화 시켜준다.
#groupby를 사용해서 데이터 통계를 확인하고 따로 요약된 데이터프레임을 가지고 다른곳에 다른방법으로 쓰기위해 
#다시 되돌릴때 사용한다.

In [ ]:
pd.read_csv('/content/mydrive/MyDrive/pandas/02. Part1.[파이썬 필수 스킬] 데이터분석의 시작, 전처리 라이브러리/data/korean-idol.csv')

# 전처리
###1. 결측값을 채워주는 fillna
fillna(): na값에 대하여 fill해주는 함수입니다.

In [ ]:
from google.colab import drive
drive.mount('/content/mydrive')

In [ ]:
import pandas as pd
df =pd.read_csv('https://bit.ly/ds-korean-idol')

In [ ]:
df.info()

키에 2개의 데이터가 누락, 그룹에 1개의 데이터가 누락된 것을 확인 할 수 있습니다.

먼저, 키가없는 사람은 존재할 수 없기 때문에 데이터가 잘 못 되어 있다는 것을 표기 하기 위하여, 누락된 데이터를 -1로 채워 보도록 하겠습니다.

In [ ]:
df['키']

In [ ]:
df['키'].fillna(-1)  # -1 말고 최빈값, 평균값 등등으로 설정 할 수  있음

NaN값이 -1 로 바뀐 것을 확인할 수 있습니다.

하지만, 키의NaN 값을 채워준 다음 유지시키려면 inplace = True 옵션을 주거나, fillna로 채워 준 값을 다시 대입해 주어야 합니다.

In [ ]:
df2 = df.copy()
df2

In [ ]:
df2['키'].fillna(-1, inplace = True)
df2

In [ ]:
이젠 유지가 됩니다. 하지만, 저는 fillna로 채워준 값을 다시 대입 해 주는 방식을 추천 드립니다.

In [ ]:
df2 = df.copy()
df2

In [ ]:
df2['키'] = df2['키'].fillna(-1)
df2['키']

2. 빈 값(NaN)이 있는 행을 제거

  1번 STEP에서 fillna 메소드를 활용하여 값을 채워 주었습니다.
  이번에는 빈값이 있는 행을 제거하는 방법을 알아보도록 하겠습니다.

In [ ]:
df.info()

In [ ]:
df

In [ ]:
df.dropna()

dropna() 는 몇가지 옵션을 추가할 수 있습니다.

 2-1. axis(열/행 을 드랍)

  axis = 0은 행을 드랍합니다.

In [ ]:
df.dropna(axis = 0)

In [ ]:
df.dropna(axis = 1) # NaN값이 있는 그룹과 키 가 날라감

2-2. how옵션 - 'any': 한개라도 있는 경우 드랍, 'all'은 모두 NaN인 경우 드랍( 위에 까지는 하나라도 있는경우 다날렸지만 세밀하게 컨트롤하기 위함)

In [ ]:
df.dropna(axis =0, how= 'any')

In [ ]:
df.dropna(axis =0, how= 'all')

In [ ]:
import numpy as np
df.iloc[10] = np.nan

In [ ]:
df

In [ ]:
df.dropna(axis =0, how= 'all')

3. 중복된 값 제거 (drop_duplicates)

In [ ]:
df = pd.read_csv('http://bit.ly/ds-korean-idol')

In [ ]:
df

3-1. column의 중복값 제거

In [ ]:
df['키']

In [ ]:
df['키'].drop_duplicates() # 기본적으로 첫번째 값 유지시키고 그다음 부터 중복값을 제거 함.

keep 옵션으로 유지하고 싶은 데이터를 선택할 수 있습니다. keep: 'first'/ 'last'

In [ ]:
df['키'].drop_duplicates(keep = 'last')

3-2. 행 전체 제거

In [ ]:
df.drop_duplicates('그룹') #데이터 프레임에서 그룹에서 겹치는 애들의 행전체를 drop

In [ ]:
df.drop_duplicates('그룹', keep = 'last')

4. Drop - column/row 제거하기(행과 열 제거하기)

In [ ]:
df.head()

4-1. column제거하기

drop()을 활용하여 column을 제거할 수 있습니다. column을 제거할 때는 axis = 1옵션을 줍니다.

In [ ]:
df.drop('그룹',axis = 1)

복수의 column를 제거하고자 할 때는 list로 지정합니다.

In [ ]:
df.drop(['그룹','소속사'], axis = 1)

4-2. row제거하기

drop()을 활용하여 row를 제거할 수 있습니다. row를 제거할 때는 제거하고자하는 index와 axis = 0옵션을 줍니다.

In [ ]:
df.drop(3, axis = 0)

복수의 row를 제거하고자 할 때는 list로 지정합니다.

In [ ]:
df.drop([3, 5], axis = 0)

1. DataFrame 합치기 (concat)

ex) 매출액 데이터가 A회사 B회사 가 있는데 합쳐서 보고싶을때 사용하면 된다.

1-1. Row 기준 합치기

In [ ]:
df = pd.read_csv('https://bit.ly/ds-korean-idol')
df2 = pd.read_csv('https://bit.ly/ds-korean-idol-2')

In [ ]:
df.head()

In [ ]:
df_copy = df.copy()
df

row 에 합칠 때는 pd.concat에 합칠 데이터 프레임을 list로 합쳐줍니다. row기준으로 합칠 때는 sort = False옵션을 주어 순서가 유지되도록 합니다.

In [ ]:
pd.concat([df, df_copy], sort = False)

그런데, index가 꼬였습니다. reset_index()로 인덱스를 초기화 해줄 수 있습니다.

In [ ]:
df_concat = pd.concat([df, df_copy], sort = False)
df_concat

In [ ]:
df_concat.reset_index()

하지만, index라는 column이 추가 됩니다. 그럴때는 drop = True 옵션으로 새로 index column이 생성되지 않도록 만들어 줍니다.

In [ ]:
df_concat.reset_index(drop = True)

1- 2. column 기준으로 합치기

이번에는 column 기준으로 횡 방향으로 합치도록 하겠습니다.

In [ ]:
df

In [ ]:
df2

column을 기준으로 합치고자 할 때는 axis = 1옵션을 부여합니다

In [ ]:
pd.concat([df, df2], axis = 1)

행의 개수가 맞지 않는 상태에서 어떻게 될까

In [ ]:
df3 = df2.drop([3, 5])
df3

In [ ]:
pd.concat([df,df3], axis = 1)

2. DataFrame 병합하기 (merge)

  이전에 봤던 concat과 merge는 단순 합치는 목적과 특정 기준(index)으로 합치느냐에 따라 용도가 다릅니다.
  - concat : row 나 column기준으로 단순하게 이어 붙히기
  - merge : 특정 고유한 키(unique id) 값을 기준으로 병합하기

In [101]:
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928

In [102]:
df2.head()

     이름    연봉  가족수
0    지민  3000    3
1  지드래곤  3500    3
2  강다니엘  3200    4
3     뷔  3050    4
4    화사  4300    3

df와 df2는 '이름' 이라는 column이 겹칩니다.

따라서, 우리는 '이름'을 기준으로 두 DataFrame을 병합할 수 있습니다.

pd.merge(left, right, on = '기준column', how = 'left')
  
  - left와 right는 병합할 두 DataFrame을 대입합니다.
  - on 에는 병합의 기준이 되는 column을 넣어 줍니다.
  - how 에는 'left', 'right', 'inner', 'outer' 라는 4가지의 병합 방식중 한가지를 택합니다.

2-1. left, right 방식

  먼저, 다음과 같이 df2 에서 5개의 데이터를 고의적으로 drop해주겠습니다.

In [103]:
df2

      이름    연봉  가족수
0     지민  3000    3
1   지드래곤  3500    3
2   강다니엘  3200    4
3      뷔  3050    4
4     화사  4300    3
5     정국  2900    5
6     민현  3400    6
7     소연  4500    5
8      진  4200    4
9    하성운  4300    4
10    태연  3700    3
11   차은우  3850    5
12    백호  3900    4
13    JR  4100    3
14    슈가  4150    3

In [107]:
df_right = df2.drop([1, 3, 5, 7, 9], axis = 0)
df_right = df_right.reset_index(drop=True)
df_right

     이름    연봉  가족수
0    지민  3000    3
1  강다니엘  3200    4
2    화사  4300    3
3    민현  3400    6
4     진  4200    4
5    태연  3700    3
6   차은우  3850    5
7    백호  3900    4
8    JR  4100    3
9    슈가  4150    3

In [108]:
df

      이름     그룹      소속사  성별        생년월일      키 혈액형   브랜드평판지수
0     지민  방탄소년단      빅히트  남자  1995-10-13  173.6   A  10523260
1   지드래곤     빅뱅       YG  남자  1988-08-18  177.0   A   9916947
2   강다니엘    NaN      커넥트  남자  1996-12-10  180.0   A   8273745
3      뷔  방탄소년단      빅히트  남자  1995-12-30  178.0  AB   8073501
4     화사    마마무      RBW  여자  1995-07-23  162.1   A   7650928
5     정국  방탄소년단      빅히트  남자  1997-09-01  178.0   A   5208335
6     민현   뉴이스트     플레디스  남자  1995-08-09  182.3   O   4989792
7     소연    아이들       큐브  여자  1998-08-26    NaN   B   4668615
8      진  방탄소년단      빅히트  남자  1992-12-04  179.2   O   4570308
9    하성운     핫샷  스타크루이엔티  남자  1994-03-22  167.1   A   4036489
10    태연   소녀시대       SM  여자  1989-03-09    NaN   A   3918661
11   차은우   아스트로     판타지오  남자  1997-03-30  183.0   B   3506027
12    백호   뉴이스트     플레디스  남자  1995-07-21  175.0  AB   3301654
13    JR   뉴이스트     플레디스  남자  1995-06-08  176.0   O   3274137
14    슈가  방탄소년단      빅히트  남자  1993-03-09  174.0   O   2925442

In [111]:
pd.concat([df, df_right], axis = 1)  
 # df와 df_right를 concat을 했을경우 이름이 전혀 맞지 않는다
 # (위에서drop으로 1,3,5,7,9,를 빼주고 index를 reset했으므로 당연히 순서가 맞지않음) 설명을 위한 설정
 # 지금 하려고 하는것이 적절하게 이름을 알아서 맞춰서 붙히게 하는것

      이름     그룹      소속사  성별        생년월일  ...  혈액형   브랜드평판지수    이름      연봉  가족수
0     지민  방탄소년단      빅히트  남자  1995-10-13  ...    A  10523260    지민  3000.0  3.0
1   지드래곤     빅뱅       YG  남자  1988-08-18  ...    A   9916947  강다니엘  3200.0  4.0
2   강다니엘    NaN      커넥트  남자  1996-12-10  ...    A   8273745    화사  4300.0  3.0
3      뷔  방탄소년단      빅히트  남자  1995-12-30  ...   AB   8073501    민현  3400.0  6.0
4     화사    마마무      RBW  여자  1995-07-23  ...    A   7650928     진  4200.0  4.0
5     정국  방탄소년단      빅히트  남자  1997-09-01  ...    A   5208335    태연  3700.0  3.0
6     민현   뉴이스트     플레디스  남자  1995-08-09  ...    O   4989792   차은우  3850.0  5.0
7     소연    아이들       큐브  여자  1998-08-26  ...    B   4668615    백호  3900.0  4.0
8      진  방탄소년단      빅히트  남자  1992-12-04  ...    O   4570308    JR  4100.0  3.0
9    하성운     핫샷  스타크루이엔티  남자  1994-03-22  ...    A   4036489    슈가  4150.0  3.0
10    태연   소녀시대       SM  여자  1989-03-09  ...    A   3918661   NaN     NaN  NaN
11   차은우   아스트로     판타지오  남자  1997-03-30  ...    B   3506027   NaN     NaN  NaN
12    백호   뉴이스트     플레디스  남자  1995-07-21  ...   AB   3301654   NaN     NaN  NaN
13    JR   뉴이스트     플레디스  남자  1995-06-08  ...    O   3274137   NaN     NaN  NaN
14    슈가  방탄소년단      빅히트  남자  1993-03-09  ...    O   2925442   NaN     NaN  NaN

[15 rows x 11 columns]

병합할 2개의 DataFrame의 행의 갯수가 맞지 않습니다. 실 사례에서도 충분히 있을 법한 일입니다.

'left'옵션을 부여하면, left DataFrame에 키 값이 존재하면 해당 데이터를 유지하고, 병합한 right DataFrame의 값은 NaN이 대입 됩니다.

In [112]:
pd.merge(df,df_right, on ='이름', how = 'left')

      이름     그룹      소속사  성별        생년월일      키 혈액형   브랜드평판지수      연봉  가족수
0     지민  방탄소년단      빅히트  남자  1995-10-13  173.6   A  10523260  3000.0  3.0
1   지드래곤     빅뱅       YG  남자  1988-08-18  177.0   A   9916947     NaN  NaN
2   강다니엘    NaN      커넥트  남자  1996-12-10  180.0   A   8273745  3200.0  4.0
3      뷔  방탄소년단      빅히트  남자  1995-12-30  178.0  AB   8073501     NaN  NaN
4     화사    마마무      RBW  여자  1995-07-23  162.1   A   7650928  4300.0  3.0
5     정국  방탄소년단      빅히트  남자  1997-09-01  178.0   A   5208335     NaN  NaN
6     민현   뉴이스트     플레디스  남자  1995-08-09  182.3   O   4989792  3400.0  6.0
7     소연    아이들       큐브  여자  1998-08-26    NaN   B   4668615     NaN  NaN
8      진  방탄소년단      빅히트  남자  1992-12-04  179.2   O   4570308  4200.0  4.0
9    하성운     핫샷  스타크루이엔티  남자  1994-03-22  167.1   A   4036489     NaN  NaN
10    태연   소녀시대       SM  여자  1989-03-09    NaN   A   3918661  3700.0  3.0
11   차은우   아스트로     판타지오  남자  1997-03-30  183.0   B   3506027  3850.0  5.0
12    백호   뉴이스트     플레디스  남자  1995-07-21  175.0  AB   3301654  3900.0  4.0
13    JR   뉴이스트     플레디스  남자  1995-06-08  176.0   O   3274137  4100.0  3.0
14    슈가  방탄소년단      빅히트  남자  1993-03-09  174.0   O   2925442  4150.0  3.0

반대로 'right' 옵션을 부여하면 right DataFrame을 기준으로 병합하게 됩니다.


현재, left Data Frame이 더 많은 데이터를 보유하고 있으니, right를 기준으로 병합하면 DataFrame 사이즈가 줄어들겠네요.

In [114]:
pd.merge(df,df_right, on ='이름', how = 'right')  
# 즉 right 데이터 프레임에 없는 이름은 자동으로 drop이 된 모양이다

     이름     그룹   소속사  성별        생년월일      키 혈액형   브랜드평판지수    연봉  가족수
0    지민  방탄소년단   빅히트  남자  1995-10-13  173.6   A  10523260  3000    3
1  강다니엘    NaN   커넥트  남자  1996-12-10  180.0   A   8273745  3200    4
2    화사    마마무   RBW  여자  1995-07-23  162.1   A   7650928  4300    3
3    민현   뉴이스트  플레디스  남자  1995-08-09  182.3   O   4989792  3400    6
4     진  방탄소년단   빅히트  남자  1992-12-04  179.2   O   4570308  4200    4
5    태연   소녀시대    SM  여자  1989-03-09    NaN   A   3918661  3700    3
6   차은우   아스트로  판타지오  남자  1997-03-30  183.0   B   3506027  3850    5
7    백호   뉴이스트  플레디스  남자  1995-07-21  175.0  AB   3301654  3900    4
8    JR   뉴이스트  플레디스  남자  1995-06-08  176.0   O   3274137  4100    3
9    슈가  방탄소년단   빅히트  남자  1993-03-09  174.0   O   2925442  4150    3

위의 예제에서, right를 기준으로 병합했기 때문에 DataFrame 사이즈가 줄어들었습니다.

2-2. inner, outer 방식
  
  - inner 방식은 두 DataFrame에 모두 키 값이 존재하는 경우만 병합합니다.
  - outer 방식은 하나의 DataFrame에 키 값이 존재하는 경우 모두 병합합니다. 
  - outer 방식에서는 없는 값은 NaN으로 대입됩니다.

In [116]:
df

      이름     그룹      소속사  성별        생년월일      키 혈액형   브랜드평판지수
0     지민  방탄소년단      빅히트  남자  1995-10-13  173.6   A  10523260
1   지드래곤     빅뱅       YG  남자  1988-08-18  177.0   A   9916947
2   강다니엘    NaN      커넥트  남자  1996-12-10  180.0   A   8273745
3      뷔  방탄소년단      빅히트  남자  1995-12-30  178.0  AB   8073501
4     화사    마마무      RBW  여자  1995-07-23  162.1   A   7650928
5     정국  방탄소년단      빅히트  남자  1997-09-01  178.0   A   5208335
6     민현   뉴이스트     플레디스  남자  1995-08-09  182.3   O   4989792
7     소연    아이들       큐브  여자  1998-08-26    NaN   B   4668615
8      진  방탄소년단      빅히트  남자  1992-12-04  179.2   O   4570308
9    하성운     핫샷  스타크루이엔티  남자  1994-03-22  167.1   A   4036489
10    태연   소녀시대       SM  여자  1989-03-09    NaN   A   3918661
11   차은우   아스트로     판타지오  남자  1997-03-30  183.0   B   3506027
12    백호   뉴이스트     플레디스  남자  1995-07-21  175.0  AB   3301654
13    JR   뉴이스트     플레디스  남자  1995-06-08  176.0   O   3274137
14    슈가  방탄소년단      빅히트  남자  1993-03-09  174.0   O   2925442

In [117]:
df_right

     이름    연봉  가족수
0    지민  3000    3
1  강다니엘  3200    4
2    화사  4300    3
3    민현  3400    6
4     진  4200    4
5    태연  3700    3
6   차은우  3850    5
7    백호  3900    4
8    JR  4100    3
9    슈가  4150    3

In [119]:
pd.merge(df, df_right, on = '이름', how = 'inner')
# 교집합

     이름     그룹   소속사  성별        생년월일      키 혈액형   브랜드평판지수    연봉  가족수
0    지민  방탄소년단   빅히트  남자  1995-10-13  173.6   A  10523260  3000    3
1  강다니엘    NaN   커넥트  남자  1996-12-10  180.0   A   8273745  3200    4
2    화사    마마무   RBW  여자  1995-07-23  162.1   A   7650928  4300    3
3    민현   뉴이스트  플레디스  남자  1995-08-09  182.3   O   4989792  3400    6
4     진  방탄소년단   빅히트  남자  1992-12-04  179.2   O   4570308  4200    4
5    태연   소녀시대    SM  여자  1989-03-09    NaN   A   3918661  3700    3
6   차은우   아스트로  판타지오  남자  1997-03-30  183.0   B   3506027  3850    5
7    백호   뉴이스트  플레디스  남자  1995-07-21  175.0  AB   3301654  3900    4
8    JR   뉴이스트  플레디스  남자  1995-06-08  176.0   O   3274137  4100    3
9    슈가  방탄소년단   빅히트  남자  1993-03-09  174.0   O   2925442  4150    3

In [121]:
pd.merge(df, df_right, on = '이름', how = 'outer')
#합집합

      이름     그룹      소속사  성별        생년월일      키 혈액형   브랜드평판지수      연봉  가족수
0     지민  방탄소년단      빅히트  남자  1995-10-13  173.6   A  10523260  3000.0  3.0
1   지드래곤     빅뱅       YG  남자  1988-08-18  177.0   A   9916947     NaN  NaN
2   강다니엘    NaN      커넥트  남자  1996-12-10  180.0   A   8273745  3200.0  4.0
3      뷔  방탄소년단      빅히트  남자  1995-12-30  178.0  AB   8073501     NaN  NaN
4     화사    마마무      RBW  여자  1995-07-23  162.1   A   7650928  4300.0  3.0
5     정국  방탄소년단      빅히트  남자  1997-09-01  178.0   A   5208335     NaN  NaN
6     민현   뉴이스트     플레디스  남자  1995-08-09  182.3   O   4989792  3400.0  6.0
7     소연    아이들       큐브  여자  1998-08-26    NaN   B   4668615     NaN  NaN
8      진  방탄소년단      빅히트  남자  1992-12-04  179.2   O   4570308  4200.0  4.0
9    하성운     핫샷  스타크루이엔티  남자  1994-03-22  167.1   A   4036489     NaN  NaN
10    태연   소녀시대       SM  여자  1989-03-09    NaN   A   3918661  3700.0  3.0
11   차은우   아스트로     판타지오  남자  1997-03-30  183.0   B   3506027  3850.0  5.0
12    백호   뉴이스트     플레디스  남자  1995-07-21  175.0  AB   3301654  3900.0  4.0
13    JR   뉴이스트     플레디스  남자  1995-06-08  176.0   O   3274137  4100.0  3.0
14    슈가  방탄소년단      빅히트  남자  1993-03-09  174.0   O   2925442  4150.0  3.0

2-3. column명은 다르지만, 동일한 성질의 데이터 인 경우?
(df_right의 데이터가 만약 이름이 아닌 성함일경우?)

In [122]:
df

      이름     그룹      소속사  성별        생년월일      키 혈액형   브랜드평판지수
0     지민  방탄소년단      빅히트  남자  1995-10-13  173.6   A  10523260
1   지드래곤     빅뱅       YG  남자  1988-08-18  177.0   A   9916947
2   강다니엘    NaN      커넥트  남자  1996-12-10  180.0   A   8273745
3      뷔  방탄소년단      빅히트  남자  1995-12-30  178.0  AB   8073501
4     화사    마마무      RBW  여자  1995-07-23  162.1   A   7650928
5     정국  방탄소년단      빅히트  남자  1997-09-01  178.0   A   5208335
6     민현   뉴이스트     플레디스  남자  1995-08-09  182.3   O   4989792
7     소연    아이들       큐브  여자  1998-08-26    NaN   B   4668615
8      진  방탄소년단      빅히트  남자  1992-12-04  179.2   O   4570308
9    하성운     핫샷  스타크루이엔티  남자  1994-03-22  167.1   A   4036489
10    태연   소녀시대       SM  여자  1989-03-09    NaN   A   3918661
11   차은우   아스트로     판타지오  남자  1997-03-30  183.0   B   3506027
12    백호   뉴이스트     플레디스  남자  1995-07-21  175.0  AB   3301654
13    JR   뉴이스트     플레디스  남자  1995-06-08  176.0   O   3274137
14    슈가  방탄소년단      빅히트  남자  1993-03-09  174.0   O   2925442

In [123]:
df_right

     이름    연봉  가족수
0    지민  3000    3
1  강다니엘  3200    4
2    화사  4300    3
3    민현  3400    6
4     진  4200    4
5    태연  3700    3
6   차은우  3850    5
7    백호  3900    4
8    JR  4100    3
9    슈가  4150    3

In [124]:
df_right.columns = ['성함', '연봉', '가족수']

In [125]:
df_right

     성함    연봉  가족수
0    지민  3000    3
1  강다니엘  3200    4
2    화사  4300    3
3    민현  3400    6
4     진  4200    4
5    태연  3700    3
6   차은우  3850    5
7    백호  3900    4
8    JR  4100    3
9    슈가  4150    3

df와 df_right를 병합하려고 했더니, df에서는  '이름', df_right에서는 '성함' 으로 표기되어 기준이 되는 column을 지정할 수 없습니다.

이럴 때는 left_on, right_on 옵션을 사용합니다.

In [127]:
pd.merge(df, df_right, left_on= '이름', right_on = '성함', how = 'outer')

      이름     그룹      소속사  성별        생년월일  ...  혈액형   브랜드평판지수    성함      연봉  가족수
0     지민  방탄소년단      빅히트  남자  1995-10-13  ...    A  10523260    지민  3000.0  3.0
1   지드래곤     빅뱅       YG  남자  1988-08-18  ...    A   9916947   NaN     NaN  NaN
2   강다니엘    NaN      커넥트  남자  1996-12-10  ...    A   8273745  강다니엘  3200.0  4.0
3      뷔  방탄소년단      빅히트  남자  1995-12-30  ...   AB   8073501   NaN     NaN  NaN
4     화사    마마무      RBW  여자  1995-07-23  ...    A   7650928    화사  4300.0  3.0
5     정국  방탄소년단      빅히트  남자  1997-09-01  ...    A   5208335   NaN     NaN  NaN
6     민현   뉴이스트     플레디스  남자  1995-08-09  ...    O   4989792    민현  3400.0  6.0
7     소연    아이들       큐브  여자  1998-08-26  ...    B   4668615   NaN     NaN  NaN
8      진  방탄소년단      빅히트  남자  1992-12-04  ...    O   4570308     진  4200.0  4.0
9    하성운     핫샷  스타크루이엔티  남자  1994-03-22  ...    A   4036489   NaN     NaN  NaN
10    태연   소녀시대       SM  여자  1989-03-09  ...    A   3918661    태연  3700.0  3.0
11   차은우   아스트로     판타지오  남자  1997-03-30  ...    B   3506027   차은우  3850.0  5.0
12    백호   뉴이스트     플레디스  남자  1995-07-21  ...   AB   3301654    백호  3900.0  4.0
13    JR   뉴이스트     플레디스  남자  1995-06-08  ...    O   3274137    JR  4100.0  3.0
14    슈가  방탄소년단      빅히트  남자  1993-03-09  ...    O   2925442    슈가  4150.0  3.0

[15 rows x 11 columns]